backend/test/artillery/stress-test.yml
# Artillery HTTP Stress Test
# Balanced high-throughput HTTP stress test (3,000+ req/sec peak)
# Run: npx artillery run test/artillery/stress-test.yml

config:
  target: "http://localhost:4000"
  phases:
    # Warmup - establish connections
    - name: "Warmup"
      duration: 15
      arrivalRate: 10
    # Gradual ramp to peak
    - name: "Ramp to load"
      duration: 30
      arrivalRate: 20
      rampTo: 80
    # Sustained high load
    - name: "Sustained load"
      duration: 60
      arrivalRate: 80
    # Brief spike test
    - name: "Spike"
      duration: 15
      arrivalRate: 120
    # Recovery
    - name: "Recovery"
      duration: 15
      arrivalRate: 40

  processor: "./functions.js"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: "application/json"

  http:
    timeout: 60
    pool: 200

  # Stress test thresholds
  ensure:
    p99: 3000
    maxErrorRate: 5

scenarios:
  # Read-heavy operations (highest throughput)
  - name: "Read Stress"
    weight: 50
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - loop:
          - get:
              url: "/api/auctions"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - think: 0.02
          - get:
              url: "/api/auctions/{{ auctionId }}"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.02
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.02
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.02
        count: 40

  # Bid operations stress
  - name: "Bid Stress"
    weight: 30
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 500000
          expect:
            - statusCode:
                - 200
                - 201
                - 409
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
          - think: 0.15
        count: 25

  # Mixed operations
  - name: "Mixed Stress"
    weight: 20
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 100000
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.03
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
          - think: 0.03
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.03
        count: 20