backend/test/artillery/stress-test.yml
# Artillery HTTP Stress Test
# Maximum HTTP throughput test for single-core backend
# Run: npx artillery run test/artillery/stress-test.yml

config:
  target: "http://localhost:4000"
  phases:
    # Warmup
    - name: "Warmup"
      duration: 10
      arrivalRate: 50
    # Ramp to high load
    - name: "Ramp"
      duration: 15
      arrivalRate: 100
      rampTo: 500
    # Sustained max load
    - name: "Max sustained"
      duration: 45
      arrivalRate: 500
      maxVusers: 3000
    # Cooldown
    - name: "Cooldown"
      duration: 10
      arrivalRate: 100

  processor: "./functions.js"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: "application/json"

  http:
    timeout: 30
    pool: 500

  # Stress test thresholds
  ensure:
    p99: 10000
    maxErrorRate: 20

scenarios:
  # Read-heavy operations (highest throughput)
  - name: "Read Stress"
    weight: 40
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - loop:
          - get:
              url: "/api/auctions"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/auctions/{{ auctionId }}"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 50

  # Bid operations stress
  - name: "Bid Stress"
    weight: 40
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 500000
          expect:
            - statusCode:
                - 200
                - 201
                - 409
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
        count: 50

  # Mixed operations
  - name: "Mixed Stress"
    weight: 20
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 100000
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 30