backend/test/artillery/websocket-extreme.yml
# Artillery WebSocket EXTREME Stress Test
# Target: 63,000+ emit/sec peak
# Run: npx artillery run test/artillery/websocket-extreme.yml

config:
  target: "http://localhost:4000"
  phases:
    # Aggressive ramp to peak
    - name: "Aggressive ramp"
      duration: 20
      arrivalRate: 200
      rampTo: 800
    # Extreme sustained at higher rate
    - name: "Extreme load"
      duration: 40
      arrivalRate: 800
    # Nuclear burst for peak measurement
    - name: "Nuclear burst"
      duration: 15
      arrivalRate: 1500

  processor: "./websocket-functions.js"

  engines:
    socketio:
      transports: ["websocket"]
      reconnection: false

  # Increase connection pool for extreme load
  http:
    pool: 1000
    timeout: 60

before:
  flow:
    - function: "setupWsTest"

scenarios:
  # Maximum throughput - 150 rapid emits per VU for higher peak
  - name: "Extreme Throughput"
    engine: socketio
    weight: 100
    beforeScenario: "beforeScenario"
    flow:
      - emit:
          channel: "auth"
          data: "{{ token }}"
      - emit:
          channel: "join-auction"
          data: "{{ auctionId }}"
      # 150 rapid-fire emits per user for 63K+ peak
      - loop:
          - function: "generateWsBidAmount"
          - emit:
              channel: "place-bid"
              data:
                auctionId: "{{ auctionId }}"
                amount: "{{ bidAmount }}"
        count: 150