backend/test/artillery/websocket-extreme.yml
# Artillery WebSocket EXTREME Stress Test
# Find the absolute breaking point
# Run: npx artillery run test/artillery/websocket-extreme.yml

config:
  target: "http://localhost:4000"
  phases:
    # Aggressive ramp
    - name: "Aggressive ramp"
      duration: 15
      arrivalRate: 100
      rampTo: 500
    # Extreme sustained
    - name: "Extreme load"
      duration: 30
      arrivalRate: 500
    # Nuclear option
    - name: "Nuclear burst"
      duration: 15
      arrivalRate: 1000

  processor: "./websocket-functions.js"

  engines:
    socketio:
      transports: ["websocket"]

  # Increase connection pool
  http:
    pool: 500
    timeout: 30

before:
  flow:
    - function: "setupWsTest"

scenarios:
  # Maximum throughput - 100 rapid emits per VU
  - name: "Extreme Throughput"
    engine: socketio
    weight: 100
    beforeScenario: "beforeScenario"
    flow:
      - emit:
          channel: "auth"
          data: "{{ token }}"
      - emit:
          channel: "join-auction"
          data: "{{ auctionId }}"
      # 100 rapid-fire emits per user
      - loop:
          - function: "generateWsBidAmount"
          - emit:
              channel: "place-bid"
              data:
                auctionId: "{{ auctionId }}"
                amount: "{{ bidAmount }}"
        count: 100